{
  "slug": "2025-12-26",
  "generatedAt": "2025-12-26T09:30:44.075Z",
  "article": {
    "title": "I sell onions on the Internet (2019)",
    "url": "https://www.deepsouthventures.com/i-sell-onions-on-the-internet/",
    "source": "deepsouthventures.com",
    "selectedAt": "2025-12-26T09:30:36.553Z",
    "publishedAt": "2025-12-25T16:24:45.000Z",
    "hn": {
      "id": 46385308,
      "score": 438,
      "comments": 127
    }
  },
  "takeaways": [],
  "summary": "In 2014, a Georgia native acquired the expired domain VidaliaOnions.com and launched a direct-to-consumer online business selling sweet Vidalia onions. Partnering with an established local farmer, the venture grew by focusing on customer service and marketing, eventually becoming a primary mail-order source as other operations exited the space. This grassroots approach highlights the potential of niche agricultural e-commerce driven by domain-led branding and persistent entrepreneurship.",
  "keyPoints": [
    "Domain VidaliaOnions.com acquired in 2014 via auction for about $2,200 after original owner abandoned it",
    "Business launched in February 2015, funded from profits of other domain projects without outside investment",
    "Partnered with Aries Haygood, a farmer with 25 years of experience and an award-winning Vidalia crop",
    "Marketing included local sponsorships and a billboard on I-95 near Savannah, GA",
    "Early operational mistakes included a $10,000 loss on faulty shipping boxes, nearly shutting down the venture",
    "Customer loyalty grew significantly, with other Vidalia producers directing mail orders to this site"
  ],
  "rewrite": {
    "title": "Building an Online Vidalia Onion Business",
    "body": "In 2014, the domain VidaliaOnions.com became available after its original owner let it expire. Recognizing the brand potential tied to his Georgia roots, the entrepreneur acquired it at auction for roughly $2,200. Over the following months, the domain inspired a direct-to-consumer business model modeled after companies like Harry & David, but focused on delivering fresh Vidalia sweet onions.\n\nLaunching in February 2015 without external funding, the founder partnered with Aries Haygood, a farmer with 25 years of experience and an award-winning Vidalia crop. While the farm handled production and packing, the entrepreneur concentrated on marketing, customer service, and logistics. This division of labor allowed the business to scale efficiently, attracting customers nationwide and becoming a preferred mail-order source as other Vidalia sellers exited the market.\n\nMarketing efforts extended beyond the website, including local sponsorships and a strategic billboard on I-95 near Savannah, Georgia. Despite early setbacks, such as a costly $10,000 mistake on shipping materials, the venture persevered, driven by strong customer loyalty and a niche product with consistent demand. The story exemplifies how domain-driven branding combined with persistent, hands-on entrepreneurship can carve out a successful online agricultural business without traditional venture capital.",
    "disclaimer": "AI-assisted rewrite based on extracted text + discussion signals"
  },
  "highlights": [],
  "meta": {
    "extract": {
      "ok": true,
      "chars": 4964
    },
    "ai": {
      "enabled": true,
      "generated": true
    }
  }
}
