{
  "slug": "2026-02-19",
  "generatedAt": "2026-02-19T09:58:22.006Z",
  "article": {
    "title": "Warren Buffett dumps $1.7B of Amazon stock",
    "url": "https://finbold.com/warren-buffett-dumps-1-7-billion-of-amazon-stock/",
    "source": "finbold.com",
    "selectedAt": "2026-02-19T09:58:15.284Z",
    "publishedAt": "2026-02-18T17:56:08.000Z",
    "hn": {
      "id": 47063950,
      "score": 152,
      "comments": 163
    }
  },
  "takeaways": [],
  "summary": "In its latest 13-F filing dated February 17, 2026, Berkshire Hathaway significantly reduced its Amazon stake by 77%, selling shares worth approximately $1.7 billion. This move signals Warren Buffett's strategic pivot away from large tech giants toward more traditional, resilient sectors amid economic uncertainty.",
  "keyPoints": [
    "Berkshire Hathaway sold 7.7 million Amazon shares, cutting its position by 77%.",
    "The conglomerate initiated a new $352 million stake in The New York Times, boosting the publisher's shares by about 10%.",
    "Apple holdings were trimmed to a 1.5% position, underscoring reduced exposure to mega tech stocks.",
    "Berkshire increased investments in stable sectors, expanding stakes in insurer Chubb and energy giant Chevron.",
    "The company agreed to acquire Occidental Petroleum’s petrochemical unit for $9.7 billion and built a $5.6 billion position in Google.",
    "These portfolio adjustments suggest a defensive repositioning ahead of a potential economic downturn."
  ],
  "rewrite": {
    "title": "Buffett Cuts $1.7B Amazon Stake, Shifts to Traditional Sectors",
    "body": "On February 17, 2026, Berkshire Hathaway disclosed a major portfolio reshuffle in its latest 13-F filing, notably slashing its Amazon stake by 77%, equivalent to selling 7.7 million shares valued near $1.7 billion. This decisive reduction marks a strategic retreat from the e-commerce giant after seven years of holding the stock, reflecting Warren Buffett’s renewed focus on sectors historically favored for their resilience.\n\nSimultaneously, Berkshire initiated a fresh $352 million investment in The New York Times, acquiring 5 million shares and triggering a roughly 10% jump in the publisher’s stock price. The firm also pared down its Apple holdings to a modest 1.5% stake, further signaling a pullback from large technology companies.\n\nIn contrast, Berkshire expanded its footprint in more traditional industries, increasing positions in insurer Chubb and energy leader Chevron. The conglomerate also committed to a $9.7 billion acquisition of Occidental Petroleum’s petrochemical business and amassed a $5.6 billion stake in Google, illustrating a nuanced approach that balances tech exposure with stable, cash-generative businesses.\n\nThese moves collectively indicate Buffett’s intent to fortify Berkshire’s portfolio against potential economic headwinds by emphasizing durable, cash-flow-rich companies over high-growth tech stocks. The shift underscores a broader investment philosophy recalibration as market conditions evolve.",
    "disclaimer": "AI-assisted rewrite based on extracted text + discussion signals"
  },
  "highlights": [],
  "meta": {
    "extract": {
      "ok": true,
      "chars": 3295
    },
    "ai": {
      "enabled": true,
      "generated": true
    }
  }
}
